---
kind: enumMember
id: F:Autodesk.Revit.DB.ViewDisplayBackgroundType.Gradient
enum: Autodesk.Revit.DB.ViewDisplayBackgroundType
source: html/e18503c2-b9bc-0c87-9e5d-0fb47644aaa9.htm
---
# Autodesk.Revit.DB.ViewDisplayBackgroundType.Gradient

Three-color simulated sky-horizon-ground combination. The sky is
 drawn in gradually changing color from the top (the "sky" color) to the
 bottom (the "horizon" color). The ground is either drawn in the single
 (the "ground") color, if the sky is visible, or in a gradient from the top
 (the "horizon") color to the bottom (the "ground") color.